[
  {
    "version": "1.2.1",
    "features_en": [
      "Data fetch issue and lateral issue when inherited without local segment type."
    ]
  },
  {
    "version": "1.2",
    "features_en": [
      "A Big data update. Lots of attributes. Black Dragon has legs and wings. Two, Three, Four and Five winged bilateral arthropods have wings. Great stuff!"
    ]
  },
  {
    "version": "1.1.17",
    "features_en": [
      "Kheceous: Two headed bilateral herbavore serpent.",
      "Shollabit: Two headed bilateral serpent which is born from blood of Medusa.",
      "Inheritance fixes for deep nested segment and part structures. Important cache update. Other fixes as well."
    ]
  },
  {
    "version": "1.1",
    "next_en": [
      "Version data. This.",
      "Fix current data and add some more."
    ],
    "features_en": [
      "Cache works.",
      "Body segments and parts inherit properly. Some monsters have wrong body parts but this is because invalid data (for example, cave orcs inherit shoulder and front legs from tetrapods AND thorax from primates)."
    ],
    "problems_en": [
      "Some properties seems to not inherit properly.",
      "Data in still invalid for many species in the end of the inheritance chain.",
      "User interface is terrible. But thats frontend responsibility."
    ]
  },
  {
    "version": "1.0",
    "features_en": [
      "Inheritance works now.",
      "Body size can now be added and is calculated.",
      "Still some inheritance problems when many nested body segments and parts."
    ],
    "problems_en": [
      "Cache does not work properly. When loading full list some items are missing.",
      "Data is unfinished, lots of missing items. Some creature properties are inherited from wrong parents (because of invalid data - because i have not had time to fix that)."
    ]
  },
  { 
    "version": "0.95",
    "features_en": [
      "First version of taxomageia"
    ],
    "problems_en": [
      "Inheritance does not work properly when having lots of segments or body parts."
    ]
  }
]

